#include "../include/user_func.h"
#include "../include/solve_func.h"
#include "../include/support.h"

//============================================================================================
///@brief Очищение буфера ввода
//============================================================================================
void clear_buf()
{
	while (getchar() != '\n');
}

//============================================================================================
///@brief Предпоказ введённого уравнения
///
///@param [in] a старший коэффициент введённого уравнения
///@param [in] b коэффициент при x
///@param [in] c свободный член
//============================================================================================
void preview(double a, double b, double c)
{
	if (!is_equal_with_zero(a))
	{
		if (!is_equal_with_zero(b))
			if (!is_equal_with_zero(c))
			{
				printf("Введённое уравнение: \n%.2f*x^2 %+.2f*x %+.2f = 0 \n", a,b,c);
			}
			else
			{
				printf("Введённое уравнение: \n%.2f*x^2 %+.2f*x = 0 \n", a,b);
			}
		else
			if (!is_equal_with_zero(c))
			{
				printf("Введённое уравнение: \n%.2f*x^2 = 0 \n", a);
			}
			else
			{
				printf("Введённое уравнение: \n%.2f*x^2 +%+.2f = 0 \n", a,c);
			}
	}
	else
	{
		if (!is_equal_with_zero(b))
		{
			if (!is_equal_with_zero(c))
			{
				printf("Введённое уравнение: \n%.2f*x +%+.2f = 0 \n", b,c);
			}
			else
			{
				printf("Введённое уравнение: \n%.2f*x = 0 \n",b);
			}
		}
		else
		{
			if (!is_equal_with_zero(c))
			{
				printf("Введённое уравнение: \n%.2f = 0 \n", c);
			}
			else
			{
				printf("Введённое уравнение: \n0 = 0 \n");
			}
		}
	}
}

//============================================================================================
///@brief                  Вывод решений
///
///@param [in] root_status количество корней
///@param [in] x1          первый корень
///@param [in] x2          второй корень
//============================================================================================
void output_root(NumberRoots root_status, double x1, double x2)
{
	switch (root_status)
	{
		case inf_root_eq:
		{
			printf("Уравнение имеет бесконечно много решений. Любое рациональное значение является ответом. \n");
			break;
		}
		case zero_root_eq:
		{
			printf("Уравнение не имеет решений. \n");
			break;
		}
		case one_root_eq:
		{
			printf("У уравнения одно решение: %.4lf \n", x1);
			break;
		}
		case two_root_eq:
		{
			printf("У уравнения два решения: %.4lf и %.4lf \n", x1, x2);
			break;
		}
		default:
		{
			printf("Такого быть не может! Ошибочное количество решений! \n");
		}
	}
}

//============================================================================================
///@brief Запуск ввода пользовательских данный
///
///@param [in] koeff            массив коэффициентов, упорядоченный по уменьшению
///                             старшинства
///@param [in] array_koeff_size количество вводимых коэффициентов
///
///@return код ошибки
//============================================================================================
Errors enter_pers_data(double *koeff, size_t array_koeff_size)
{
	check(koeff != nullptr, arg_function_is_nullptr)

	char array_koeff_symbs[] = {'a', 'b', 'c'};

	for (size_t count = 0; count < array_koeff_size; count++)
	{
		enter_koeff(koeff + count, array_koeff_symbs[count]);
	}

	return no_error;
}

//============================================================================================
/// @brief                  Запись введённых пользователем коэффициентов
///
/// @param [in] koeff       массив коэффициентов, упорядоченный по уменьшению
///                         старшинства
/// @param [in] koeff_symbs символ вводимого коэффициента квадратного уравнения
/// @param []
///
/// @return                 код ошибки
//============================================================================================
Errors enter_koeff(double *koeff, char koeff_symbs)
{
	check(koeff != nullptr, arg_function_is_nullptr)

	printf("Введите %c: \n", koeff_symbs);
	while ( (scanf("%lf", koeff)) != 1 )
	{
			printf("Коэффициент должен быть числовым. Попробуйте ввести его ещё раз. \n");
			clear_buf();
	}

	clear_buf();

	return no_error;
}

//============================================================================================
/// @brief Ввод переменной для продолжения цикла
///
/// @note зацикливание происходит в случае ввода любой переменной кроме "0"
///
/// @return 1 в случае ввода любого ненулевого числа , 0 в случае ввода "0"
//============================================================================================
int enter_run_var()
{
	int var = 0;

	while ( !(scanf("%d", &var)) )
	{
		printf("Введите числовое значение: \n");
		clear_buf();
	}

	clear_buf();

	return (var == 1) ? 1 : 0;
}
